perf/scenarios/load-testing/metar.yaml
config:
  payload:
    path: "../payloads/stations.csv"
    fields:
      - "station"
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: "artillery-api"

  environments:
    base-case:
      target: "http://localhost:5555/api/metar"
      variables:
        cache: "false"
    cache:
      target: "http://localhost:5555/api/metar"
      variables:
        cache: "true"
    replication:
      target: "http://localhost:5555/replicated_api/metar"
      variables:
        cache: "false"
    rate-limiting:
      target: "http://localhost:5555/api/limited/metar"
      variables:
        cache: "false"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: warm-up
      duration: 45
      arrivalRate: 10
    - name: ramp-up
      duration: 45
      arrivalRate: 10
      rampTo: 30
    - name: plain
      duration: 90
      arrivalRate: 30

scenarios:
  - name: METAR - Root (/)
    flow:
      - get:
          url: "/"
          qs:
            cache: "{{ cache }}"
            station: "{{ station }}"